----------------1-2------------------
select ОБОРУДОВАНИЕ.[Тип оборудования], max(Количество)[макс], min(Количество)[мин],avg(Количество)[средн],sum(Количество)[сумм],count(*)[общее колич]
from ОБОРУДОВАНИЕ Group by [Тип оборудования]
-----------------3-------------------
select *
	from (select case when Количество BETWEEN 5 AND 10 then '5-10'
					  when Количество BETWEEN 2 AND 4 then '2-4'
					  when Количество BETWEEN 1 AND 2 then '1-2'
					  ELSE '-'
					  END [Оценка количества], COUNT(*) [Количество]
	from ОБОРУДОВАНИЕ GROUP BY case
		when Количество BETWEEN 5 AND 10 then '5-10'
		when Количество BETWEEN 2 AND 4 then '2-4'
		when Количество BETWEEN 1 AND 2 then '1-2' 
		ELSE '-'
		END ) AS T
			ORDER BY [Оценка количества]desc

-----------------4-------------------
select  СПИСАНИЯ.Название, ОБОРУДОВАНИЕ.Количество,
	round(avg(cast(ОБОРУДОВАНИЕ.Количество as float(1))),2) as [средн] from СПИСАНИЯ
inner join ОБОРУДОВАНИЕ on ОБОРУДОВАНИЕ.[Название оборудования] = СПИСАНИЯ.Название
group by СПИСАНИЯ.Название, ОБОРУДОВАНИЕ.Количество
ORDER BY [средн]desc
-----------------5-6-------------------
select  СПИСАНИЯ.Название, ОБОРУДОВАНИЕ.Количество,
	round(avg(cast(ОБОРУДОВАНИЕ.Количество as float(1))),2) as [средн] from СПИСАНИЯ
inner join ОБОРУДОВАНИЕ on ОБОРУДОВАНИЕ.[Название оборудования] = СПИСАНИЯ.Название
where ОБОРУДОВАНИЕ.[Название оборудования] = N'Утюг'
group by СПИСАНИЯ.Название, ОБОРУДОВАНИЕ.Количество
ORDER BY [средн]desc

-------------7-----------------------
select [Название оборудования], count(КОЛИЧЕСТВО)[количество предметов = 3 или 4]
	from ОБОРУДОВАНИЕ
	group by [Название оборудования], 
	Количество having ОБОРУДОВАНИЕ.Количество = 3 or ОБОРУДОВАНИЕ.Количество = 4  