select * from ОБОРУДОВАНИЕ;
update ОБОРУДОВАНИЕ set Количество ='1' where Тип_оборудования='тип1';
alter table ОБОРУДОВАНИЕ add yyy int;



















select * from ОБОРУДОВАНИЕ
select Название_оборудования from ОБОРУДОВАНИЕ where Название_оборудования = 'предмет1'
update ОБОРУДОВАНИЕ set Количество=2 where Название_оборудования = 'предмет1'
select count(*) from ОБОРУДОВАНИЕ
update ОБОРУДОВАНИЕ set Количество=3 where Название_оборудования='предмет1'



Delete from ОБОРУДОВАНИЕ where Название_оборудования='предмет3'










